## Plan for orchestrator
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.zap_runner_policies will be updated in-place
  ~ resource "aws_iam_policy" "zap_runner_policies" {
        id        = "arn:aws:iam::507252742351:policy/OWASPZapTaskExecutionPolicies"
        name      = "OWASPZapTaskExecutionPolicies"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (3 unchanged elements hidden)
                    {
                        Action   = "ec2:DescribeNetworkInterfaces"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::scan-websites-production-owasp-zap-report-data",
                          + "arn:aws:s3:::scan-websites-production-nuclei-report-data/*",
                          + "arn:aws:s3:::scan-websites-production-nuclei-report-data",
                        ]
                        # (3 unchanged elements hidden)
                    },
                    {
                        Action   = [
                            "states:SendTaskSuccess",
                            "states:SendTaskHeartbeat",
                            "states:SendTaskFailure",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:states:ca-central-1:507252742351:*"
                        Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.orchestrator will be updated in-place
  ~ resource "aws_lambda_function" "orchestrator" {
        id                             = "orchestrator"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "STEP_FUNC_ARN" = "arn:aws:states:ca-central-1:507252742351:stateMachine:dynamic-security-scans"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_sfn_state_machine.dynamic_security_scans will be created
  + resource "aws_sfn_state_machine" "dynamic_security_scans" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = jsonencode(
            {
              + Comment        = "Synchronously run dynamic vulnerability scanning fargate tasks"
              + StartAt        = "Choice"
              + States         = {
                  + Choice        = {
                      + Choices = [
                          + {
                              + IsPresent = false
                              + Next      = "Done"
                              + Variable  = "$.payload[0]"
                            },
                          + {
                              + Next          = "nuclei"
                              + StringMatches = "nuclei"
                              + Variable      = "$.payload[0].name"
                            },
                          + {
                              + Next          = "owasp-zap"
                              + StringMatches = "owasp-zap"
                              + Variable      = "$.payload[0].name"
                            },
                        ]
                      + Default = "Done"
                      + Type    = "Choice"
                    }
                  + Done          = {
                      + End  = true
                      + Type = "Pass"
                    }
                  + SetupNextScan = {
                      + Next       = "Choice"
                      + Parameters = {
                          + payload.$ = "$.payload[1:$.payload.ItemsCount]"
                        }
                      + ResultPath = "$"
                      + Type       = "Pass"
                    }
                  + nuclei        = {
                      + HeartbeatSeconds = 300
                      + InputPath        = "$.payload[0]"
                      + Next             = "SetupNextScan"
                      + Parameters       = {
                          + CapacityProviderStrategy = [
                              + {
                                  + Base             = 1
                                  + CapacityProvider = "FARGATE_SPOT"
                                  + Weight           = 5
                                },
                              + {
                                  + Base             = 0
                                  + CapacityProvider = "FARGATE"
                                  + Weight           = 1
                                },
                            ]
                          + Cluster                  = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
                          + NetworkConfiguration     = {
                              + AwsvpcConfiguration = {
                                  + SecurityGroups = [
                                      + "sg-0ffc24ab70e3c764d",
                                    ]
                                  + Subnets        = [
                                      + "subnet-0c3abcc29d00b8589",
                                      + "subnet-0d16dd34a0f0a4589",
                                      + "subnet-0e48adc704a15a982",
                                    ]
                                }
                            }
                          + Overrides                = {
                              + ContainerOverrides = [
                                  + {
                                      + Environment = [
                                          + {
                                              + Name    = "SCAN_URL"
                                              + Value.$ = "$.url"
                                            },
                                          + {
                                              + Name    = "SCAN_ID"
                                              + Value.$ = "$.id"
                                            },
                                          + {
                                              + Name  = "REPORT_DATA_BUCKET"
                                              + Value = "scan-websites-production-nuclei-report-data"
                                            },
                                          + {
                                              + Name    = "TASK_TOKEN_ENV_VARIABLE"
                                              + Value.$ = "$$.Task.Token"
                                            },
                                        ]
                                      + Name        = "runners-nuclei"
                                    },
                                ]
                            }
                          + TaskDefinition           = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-nuclei:2"
                        }
                      + Resource         = "arn:aws:states:::ecs:runTask.waitForTaskToken"
                      + ResultPath       = null
                      + TimeoutSeconds   = 7200
                      + Type             = "Task"
                    }
                  + owasp-zap     = {
                      + HeartbeatSeconds = 300
                      + InputPath        = "$.payload[0]"
                      + Next             = "SetupNextScan"
                      + Parameters       = {
                          + CapacityProviderStrategy = [
                              + {
                                  + Base             = 1
                                  + CapacityProvider = "FARGATE_SPOT"
                                  + Weight           = 5
                                },
                              + {
                                  + Base             = 0
                                  + CapacityProvider = "FARGATE"
                                  + Weight           = 1
                                },
                            ]
                          + Cluster                  = "arn:aws:ecs:ca-central-1:507252742351:cluster/scanning-tools"
                          + NetworkConfiguration     = {
                              + AwsvpcConfiguration = {
                                  + SecurityGroups = [
                                      + "sg-0ffc24ab70e3c764d",
                                    ]
                                  + Subnets        = [
                                      + "subnet-0c3abcc29d00b8589",
                                      + "subnet-0d16dd34a0f0a4589",
                                      + "subnet-0e48adc704a15a982",
                                    ]
                                }
                            }
                          + Overrides                = {
                              + ContainerOverrides = [
                                  + {
                                      + Environment = [
                                          + {
                                              + Name    = "SCAN_URL"
                                              + Value.$ = "$.url"
                                            },
                                          + {
                                              + Name    = "SCAN_ID"
                                              + Value.$ = "$.id"
                                            },
                                          + {
                                              + Name  = "SCAN_THREADS"
                                              + Value = "3"
                                            },
                                          + {
                                              + Name  = "REPORT_DATA_BUCKET"
                                              + Value = "scan-websites-production-owasp-zap-report-data"
                                            },
                                          + {
                                              + Name    = "TASK_TOKEN_ENV_VARIABLE"
                                              + Value.$ = "$$.Task.Token"
                                            },
                                        ]
                                      + Name        = "runners-owasp-zap"
                                    },
                                ]
                            }
                          + TaskDefinition           = "arn:aws:ecs:ca-central-1:507252742351:task-definition/runners-owasp-zap:4"
                        }
                      + Resource         = "arn:aws:states:::ecs:runTask.waitForTaskToken"
                      + ResultPath       = null
                      + TimeoutSeconds   = 7200
                      + Type             = "Task"
                    }
                }
              + TimeoutSeconds = 14400
              + Version        = "1.0"
            }
        )
      + id            = (known after apply)
      + name          = "dynamic-security-scans"
      + role_arn      = "arn:aws:iam::507252742351:role/scan-websites-orchestrator"
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "scan-websites-production"
        }
      + tags_all      = {
          + "CostCentre" = "scan-websites-production"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nuclei-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.owasp-zap-log"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-nuclei"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.runners-owasp-zap"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.zap_runner_policies"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.container_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.orchestrator"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.security_tools_scanning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sfn_state_machine.dynamic_security_scans"]

23 tests, 8 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
